#2) У вас есть переменная value, тип - int.
#Написать тернарный оператор для переменной new_value по такому правилу: если value меньше 100, то new_value равно 1, в противном случае - 0

value = int(input("2) если value меньше 100, то new_value равно 1, в противном случае - 0"))

new_value = print(1) if value < 100 else print(0)


#####################################################