Задание №2 выполнить в отдельном py файле. Все пункты задания отделять друг от друга строкой символов комментария. Вот так:
#####################################################
Теперь задания:
1) У вас есть список my_list с значениями типа int. Распечатать те значения, которые больше 100. Задание выполнить с помощью цикла for.

2) У вас есть список my_list с значениями типа int, и пустой список my_results. Добавить в my_results те значения, которые больше 100. Распечатать список my_results. Задание выполнить с помощью цикла for.

3) У вас есть список my_list с значениями типа int. Если в my_list количество элементов меньше 2, то в конец добавить значение 0. Если количество элементов больше или равно 2, то добавить сумму последних двух элементов. Количество элементов в списке можно получить с помощью функции len(my_list)

4) Пользователь вводит value - число с запятой (например 3.14) с клавиатуры. Вы приводите это value к типу float и выводите результат выражения value ** -1. Написать программу, которая вычисляет данное выражение и корректно обрабатывает возможные исключения.