# 1. Дано целое число (int). Определить сколько нулей в этом числе.

######################################################

numb = 1021284010000000122310355653043015134
numb = str(numb)
print(numb.count("0"))
######################################################


#4. Дан список my_list. Создать список new_list у которого первый элемент из my_list стоит на последнем месте.
# Если my_list [1,2,3,4], то new_list [2,3,4,1]
####################################################

my_list = [1, 2, 3, 4]
new_list = my_list[:]
del new_list[0]
index_zero_my_list = my_list.copy()
new_list.append(my_list[0])
print(new_list)

####################################################