# 1. Дано целое число (int). Определить сколько нулей в этом числе.

numb = 1021284010000000122310355653043015134
numb = str(numb)
print(numb.count("0"))


