'''1) Создать список из 20 случайных целых чисел в диапазоне от 1 до 100.
Задание можно выполнить и через обычный цикл и через генератор списков'''
#####################################+######################################
import random
lst_1 = list()

cnt = 19
while cnt >= 0:
    a = random.randint(1, 101)
    lst_1.append(a)
    cnt -= 1
print(len(lst_1))
print(lst_1)

############################################################################
'''2) Создать словарь triangle в который записать точки A B C, и их координаты (кортежи) ,
созданные случайным образом с помощью модуля random.'''
############################################################################

triangle_dict = {}

triangle_dict["A"]








############################################################################
'''3) Создать функцию my_print, которая принимает строку и печатает ее
с тремя символами * вначале и в конце строки.
Пример:
my_str = 'I'm the string'
Печатает ***I'm the string*** '''
############################################################################



############################################################################
'''4)Создать функцию my_print, которая принимает строку и печатает ее
с символами * НАД и ПОД строкой. КОЛИЧЕСТВО СИМВОЛОВ * РАВНО КОЛИЧЕСТВУ СИМВОЛОВ В СТРОКЕ
Пример:
my_str = 'I'm the string'
Печатает
**************
I'm the string
**************  '''
############################################################################



############################################################################
''' 5) То же, что 4, но ответ должен выглядеть так:
********************
***I'm the string***
********************  '''
############################################################################



############################################################################