'''1) Создать список из 20 случайных целых чисел в диапазоне от 1 до 100.
Задание можно выполнить и через обычный цикл и через генератор списков'''
#####################################+######################################



############################################################################
'''2) Создать словарь triangle в который записать точки A B C, и их координаты (кортежи) ,
созданные случайным образом с помощью модуля random.'''
############################################################################








############################################################################
'''3) Создать функцию my_print, которая принимает строку и печатает ее
с тремя символами * вначале и в конце строки.
Пример:
my_str = 'I'm the string'
Печатает ***I'm the string*** '''
############################################################################
'''------------------------------*-------------------------------------'''
def my_print_1(val):
    print(f"***{val}***")
    return val
# my_print_1(122)


############################################################################
'''4)Создать функцию my_print, которая принимает строку и печатает ее
с символами * НАД и ПОД строкой. КОЛИЧЕСТВО СИМВОЛОВ * РАВНО КОЛИЧЕСТВУ СИМВОЛОВ В СТРОКЕ
Пример:
my_str = 'I'm the string'
Печатает
**************
I'm the string
**************  '''
############################################################################
'''------------------------------*-------------------------------------'''
def my_print_2(val):
    val = str(val)
    print(f"{len(val) * '*'}")
    print(f"***{val}***")
    print(f"{len(val) * '*'}")
    return val
# my_print_2("fghjkl123124")


############################################################################
''' 5) То же, что 4, но ответ должен выглядеть так:
********************
***I'm the string***
********************  '''
############################################################################

# def my_print_3(val):


############################################################################